7767517
81 84
Input            data             0 1 data 0=112 1=112 2=3
Convolution      conv1_new        1 1 data conv1_new 0=16 1=3 2=1 3=2 4=1 5=0 6=432
BatchNorm        conv1/bn_new     1 1 conv1_new conv1_new_conv1/bn_new 0=16
Scale            conv1/scale_new  1 1 conv1_new_conv1/bn_new conv1_new_conv1/scale_new 0=16 1=1
ReLU             relu1_new        1 1 conv1_new_conv1/scale_new conv1_new_relu1_new
Convolution      conv1_1/in/pw_new 1 1 conv1_new_relu1_new conv1_1/in/pw_new 0=64 1=1 2=1 3=1 4=0 5=0 6=1024
BatchNorm        conv1_1/in/pw/bn_new 1 1 conv1_1/in/pw_new conv1_1/in/pw_new_conv1_1/in/pw/bn_new 0=64
Scale            conv1_1/in/pw/scale_new 1 1 conv1_1/in/pw_new_conv1_1/in/pw/bn_new conv1_1/in/pw_new_conv1_1/in/pw/scale_new 0=64 1=1
ReLU             relu1_1/in/pw_new 1 1 conv1_1/in/pw_new_conv1_1/in/pw/scale_new conv1_1/in/pw_new_relu1_1/in/pw_new
ConvolutionDepthWise conv1_1/dw_new   1 1 conv1_1/in/pw_new_relu1_1/in/pw_new conv1_1/dw_new 0=64 1=3 2=1 3=2 4=1 5=0 6=576 7=64
BatchNorm        conv1_1/dw/bn_new 1 1 conv1_1/dw_new conv1_1/dw_new_conv1_1/dw/bn_new 0=64
Scale            conv1_1/dw/scale_new 1 1 conv1_1/dw_new_conv1_1/dw/bn_new conv1_1/dw_new_conv1_1/dw/scale_new 0=64 1=1
ReLU             relu1_1/dw_new   1 1 conv1_1/dw_new_conv1_1/dw/scale_new conv1_1/dw_new_relu1_1/dw_new
Convolution      conv1_1/out/pw_new 1 1 conv1_1/dw_new_relu1_1/dw_new conv1_1/out/pw_new 0=24 1=1 2=1 3=1 4=0 5=0 6=1536
BatchNorm        conv1_1/out/pw/bn_new 1 1 conv1_1/out/pw_new conv1_1/out/pw_new_conv1_1/out/pw/bn_new 0=24
Scale            conv1_1/out/pw/scale_new 1 1 conv1_1/out/pw_new_conv1_1/out/pw/bn_new conv1_1/out/pw_new_conv1_1/out/pw/scale_new 0=24 1=1
Split            splitncnn_0      1 2 conv1_1/out/pw_new_conv1_1/out/pw/scale_new conv1_1/out/pw_new_conv1_1/out/pw/scale_new_splitncnn_0 conv1_1/out/pw_new_conv1_1/out/pw/scale_new_splitncnn_1
Convolution      conv1_2/in/pw_new 1 1 conv1_1/out/pw_new_conv1_1/out/pw/scale_new_splitncnn_1 conv1_2/in/pw_new 0=144 1=1 2=1 3=1 4=0 5=0 6=3456
BatchNorm        conv1_2/in/pw/bn_new 1 1 conv1_2/in/pw_new conv1_2/in/pw_new_conv1_2/in/pw/bn_new 0=144
Scale            conv1_2/in/pw/scale_new 1 1 conv1_2/in/pw_new_conv1_2/in/pw/bn_new conv1_2/in/pw_new_conv1_2/in/pw/scale_new 0=144 1=1
ReLU             relu1_2/in/pw_new 1 1 conv1_2/in/pw_new_conv1_2/in/pw/scale_new conv1_2/in/pw_new_relu1_2/in/pw_new
ConvolutionDepthWise conv1_2/dw_new   1 1 conv1_2/in/pw_new_relu1_2/in/pw_new conv1_2/dw_new 0=144 1=3 2=1 3=1 4=1 5=0 6=1296 7=144
BatchNorm        conv1_2/dw/bn_new 1 1 conv1_2/dw_new conv1_2/dw_new_conv1_2/dw/bn_new 0=144
Scale            conv1_2/dw/scale_new 1 1 conv1_2/dw_new_conv1_2/dw/bn_new conv1_2/dw_new_conv1_2/dw/scale_new 0=144 1=1
ReLU             relu1_2/dw_new   1 1 conv1_2/dw_new_conv1_2/dw/scale_new conv1_2/dw_new_relu1_2/dw_new
Convolution      conv1_2/out/pw_new 1 1 conv1_2/dw_new_relu1_2/dw_new conv1_2/out/pw_new 0=24 1=1 2=1 3=1 4=0 5=0 6=3456
BatchNorm        conv1_2/out/pw/bn_new 1 1 conv1_2/out/pw_new conv1_2/out/pw_new_conv1_2/out/pw/bn_new 0=24
Scale            conv1_2/out/pw/scale_new 1 1 conv1_2/out/pw_new_conv1_2/out/pw/bn_new conv1_2/out/pw_new_conv1_2/out/pw/scale_new 0=24 1=1
Eltwise          fuse_conv1_2     2 1 conv1_1/out/pw_new_conv1_1/out/pw/scale_new_splitncnn_0 conv1_2/out/pw_new_conv1_2/out/pw/scale_new fuse_conv1_2 0=1 -23301=0
Convolution      conv2_1/in/pw_new 1 1 fuse_conv1_2 conv2_1/in/pw_new 0=144 1=1 2=1 3=1 4=0 5=0 6=3456
BatchNorm        conv2_1/in/pw/bn_new 1 1 conv2_1/in/pw_new conv2_1/in/pw_new_conv2_1/in/pw/bn_new 0=144
Scale            conv2_1/in/pw/scale_new 1 1 conv2_1/in/pw_new_conv2_1/in/pw/bn_new conv2_1/in/pw_new_conv2_1/in/pw/scale_new 0=144 1=1
ReLU             relu2_1/in/pw_new 1 1 conv2_1/in/pw_new_conv2_1/in/pw/scale_new conv2_1/in/pw_new_relu2_1/in/pw_new
ConvolutionDepthWise conv2_1/dw_new   1 1 conv2_1/in/pw_new_relu2_1/in/pw_new conv2_1/dw_new 0=144 1=3 2=1 3=2 4=1 5=0 6=1296 7=144
BatchNorm        conv2_1/dw/bn_new 1 1 conv2_1/dw_new conv2_1/dw_new_conv2_1/dw/bn_new 0=144
Scale            conv2_1/dw/scale_new 1 1 conv2_1/dw_new_conv2_1/dw/bn_new conv2_1/dw_new_conv2_1/dw/scale_new 0=144 1=1
ReLU             relu2_1/dw_new   1 1 conv2_1/dw_new_conv2_1/dw/scale_new conv2_1/dw_new_relu2_1/dw_new
Convolution      conv2_1/out/pw_new 1 1 conv2_1/dw_new_relu2_1/dw_new conv2_1/out/pw_new 0=32 1=1 2=1 3=1 4=0 5=0 6=4608
BatchNorm        conv2_1/out/pw/bn_new 1 1 conv2_1/out/pw_new conv2_1/out/pw_new_conv2_1/out/pw/bn_new 0=32
Scale            conv2_1/out/pw/scale_new 1 1 conv2_1/out/pw_new_conv2_1/out/pw/bn_new conv2_1/out/pw_new_conv2_1/out/pw/scale_new 0=32 1=1
Split            splitncnn_1      1 2 conv2_1/out/pw_new_conv2_1/out/pw/scale_new conv2_1/out/pw_new_conv2_1/out/pw/scale_new_splitncnn_0 conv2_1/out/pw_new_conv2_1/out/pw/scale_new_splitncnn_1
Convolution      conv2_2/in/pw_new 1 1 conv2_1/out/pw_new_conv2_1/out/pw/scale_new_splitncnn_1 conv2_2/in/pw_new 0=192 1=1 2=1 3=1 4=0 5=0 6=6144
BatchNorm        conv2_2/in/pw/bn_new 1 1 conv2_2/in/pw_new conv2_2/in/pw_new_conv2_2/in/pw/bn_new 0=192
Scale            conv2_2/in/pw/scale_new 1 1 conv2_2/in/pw_new_conv2_2/in/pw/bn_new conv2_2/in/pw_new_conv2_2/in/pw/scale_new 0=192 1=1
ReLU             relu2_2/in/pw_new 1 1 conv2_2/in/pw_new_conv2_2/in/pw/scale_new conv2_2/in/pw_new_relu2_2/in/pw_new
ConvolutionDepthWise conv2_2/dw_new   1 1 conv2_2/in/pw_new_relu2_2/in/pw_new conv2_2/dw_new 0=192 1=3 2=1 3=1 4=1 5=0 6=1728 7=192
BatchNorm        conv2_2/dw/bn_new 1 1 conv2_2/dw_new conv2_2/dw_new_conv2_2/dw/bn_new 0=192
Scale            conv2_2/dw/scale_new 1 1 conv2_2/dw_new_conv2_2/dw/bn_new conv2_2/dw_new_conv2_2/dw/scale_new 0=192 1=1
ReLU             relu2_2/dw_new   1 1 conv2_2/dw_new_conv2_2/dw/scale_new conv2_2/dw_new_relu2_2/dw_new
Convolution      conv2_2/out/pw_new 1 1 conv2_2/dw_new_relu2_2/dw_new conv2_2/out/pw_new 0=32 1=1 2=1 3=1 4=0 5=0 6=6144
BatchNorm        conv2_2/out/pw/bn_new 1 1 conv2_2/out/pw_new conv2_2/out/pw_new_conv2_2/out/pw/bn_new 0=32
Scale            conv2_2/out/pw/scale_new 1 1 conv2_2/out/pw_new_conv2_2/out/pw/bn_new conv2_2/out/pw_new_conv2_2/out/pw/scale_new 0=32 1=1
Eltwise          fuse_conv2_2     2 1 conv2_1/out/pw_new_conv2_1/out/pw/scale_new_splitncnn_0 conv2_2/out/pw_new_conv2_2/out/pw/scale_new fuse_conv2_2 0=1 -23301=0
Convolution      conv3_1/in/pw_new 1 1 fuse_conv2_2 conv3_1/in/pw_new 0=192 1=1 2=1 3=1 4=0 5=0 6=6144
BatchNorm        conv3_1/in/pw/bn_new 1 1 conv3_1/in/pw_new conv3_1/in/pw_new_conv3_1/in/pw/bn_new 0=192
Scale            conv3_1/in/pw/scale_new 1 1 conv3_1/in/pw_new_conv3_1/in/pw/bn_new conv3_1/in/pw_new_conv3_1/in/pw/scale_new 0=192 1=1
ReLU             relu3_1/in/pw_new 1 1 conv3_1/in/pw_new_conv3_1/in/pw/scale_new conv3_1/in/pw_new_relu3_1/in/pw_new
ConvolutionDepthWise conv3_1/dw_new   1 1 conv3_1/in/pw_new_relu3_1/in/pw_new conv3_1/dw_new 0=192 1=3 2=1 3=2 4=1 5=0 6=1728 7=192
BatchNorm        conv3_1/dw/bn_new 1 1 conv3_1/dw_new conv3_1/dw_new_conv3_1/dw/bn_new 0=192
Scale            conv3_1/dw/scale_new 1 1 conv3_1/dw_new_conv3_1/dw/bn_new conv3_1/dw_new_conv3_1/dw/scale_new 0=192 1=1
ReLU             relu3_1/dw_new   1 1 conv3_1/dw_new_conv3_1/dw/scale_new conv3_1/dw_new_relu3_1/dw_new
Convolution      conv3_1/out/pw_new 1 1 conv3_1/dw_new_relu3_1/dw_new conv3_1/out/pw_new 0=64 1=1 2=1 3=1 4=0 5=0 6=12288
BatchNorm        conv3_1/out/pw/bn_new 1 1 conv3_1/out/pw_new conv3_1/out/pw_new_conv3_1/out/pw/bn_new 0=64
Scale            conv3_1/out/pw/scale_new 1 1 conv3_1/out/pw_new_conv3_1/out/pw/bn_new conv3_1/out/pw_new_conv3_1/out/pw/scale_new 0=64 1=1
Split            splitncnn_2      1 2 conv3_1/out/pw_new_conv3_1/out/pw/scale_new conv3_1/out/pw_new_conv3_1/out/pw/scale_new_splitncnn_0 conv3_1/out/pw_new_conv3_1/out/pw/scale_new_splitncnn_1
Convolution      conv3_2/in/pw_new 1 1 conv3_1/out/pw_new_conv3_1/out/pw/scale_new_splitncnn_1 conv3_2/in/pw_new 0=192 1=1 2=1 3=1 4=0 5=0 6=12288
BatchNorm        conv3_2/in/pw/bn_new 1 1 conv3_2/in/pw_new conv3_2/in/pw_new_conv3_2/in/pw/bn_new 0=192
Scale            conv3_2/in/pw/scale_new 1 1 conv3_2/in/pw_new_conv3_2/in/pw/bn_new conv3_2/in/pw_new_conv3_2/in/pw/scale_new 0=192 1=1
ReLU             relu3_2/in/pw_new 1 1 conv3_2/in/pw_new_conv3_2/in/pw/scale_new conv3_2/in/pw_new_relu3_2/in/pw_new
ConvolutionDepthWise conv3_2/dw_new   1 1 conv3_2/in/pw_new_relu3_2/in/pw_new conv3_2/dw_new 0=192 1=3 2=1 3=1 4=1 5=0 6=1728 7=192
BatchNorm        conv3_2/dw/bn_new 1 1 conv3_2/dw_new conv3_2/dw_new_conv3_2/dw/bn_new 0=192
Scale            conv3_2/dw/scale_new 1 1 conv3_2/dw_new_conv3_2/dw/bn_new conv3_2/dw_new_conv3_2/dw/scale_new 0=192 1=1
ReLU             relu3_2/dw_new   1 1 conv3_2/dw_new_conv3_2/dw/scale_new conv3_2/dw_new_relu3_2/dw_new
Convolution      conv3_2/out/pw_new 1 1 conv3_2/dw_new_relu3_2/dw_new conv3_2/out/pw_new 0=64 1=1 2=1 3=1 4=0 5=0 6=12288
BatchNorm        conv3_2/out/pw/bn_new 1 1 conv3_2/out/pw_new conv3_2/out/pw_new_conv3_2/out/pw/bn_new 0=64
Scale            conv3_2/out/pw/scale_new 1 1 conv3_2/out/pw_new_conv3_2/out/pw/bn_new conv3_2/out/pw_new_conv3_2/out/pw/scale_new 0=64 1=1
Eltwise          fuse_conv3_2     2 1 conv3_1/out/pw_new_conv3_1/out/pw/scale_new_splitncnn_0 conv3_2/out/pw_new_conv3_2/out/pw/scale_new fuse_conv3_2 0=1 -23301=0
InnerProduct     fc1              1 1 fuse_conv3_2 fc1 0=512 1=1 2=1605632
ReLU             relu_fc1         1 1 fc1 fc1_relu_fc1
Dropout          drop_fc1         1 1 fc1_relu_fc1 fc1_drop_fc1
InnerProduct     landmark_pred    1 1 fc1_drop_fc1 landmark_pred 0=254 1=1 2=130048
